garyPenhook/PyAvrOCD/svd/attiny827.svd
        <register>
          <name>MUXNEG</name>
          <description>Negative mux input</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXNEG</name>
              <description>Analog Channel Selection Bits</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIN1</name>
                  <description>ADC input pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN2</name>
                  <description>ADC input pin 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN3</name>
                  <description>ADC input pin 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN4</name>
                  <description>ADC input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>ADC input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN6</name>
                  <description>ADC input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN7</name>
                  <description>ADC input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDDIV10</name>
                  <description>VDD/10</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACREF0</name>
                  <description>DACREF from AC0</description>
                  <value>51</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VIA</name>
              <description>VIA</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>Via ADC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGA</name>
                  <description>Via PGA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUXPOS</name>
          <description>Positive mux input</description>
          <addressOffset>0xC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MUXPOS</name>
              <description>Analog Channel Selection Bits</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIN1</name>
                  <description>ADC input pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN2</name>
                  <description>ADC input pin 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN3</name>
                  <description>ADC input pin 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN4</name>
                  <description>ADC input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>ADC input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN6</name>
                  <description>ADC input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN7</name>
                  <description>ADC input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN8</name>
                  <description>ADC input pin 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN9</name>
                  <description>ADC input pin 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN10</name>
                  <description>ADC input pin 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN11</name>
                  <description>ADC input pin 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN12</name>
                  <description>ADC input pin 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN13</name>
                  <description>ADC input pin 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN14</name>
                  <description>ADC input pin 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN15</name>
                  <description>ADC input pin 15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDDIV10</name>
                  <description>VDD/10</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE</name>
                  <description>Temperature sensor</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DACREF0</name>
                  <description>DACREF from AC0</description>
                  <value>51</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VIA</name>
              <description>VIA</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>Via ADC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGA</name>
                  <description>Via PGA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PGACTRL</name>
          <description>PGA Control</description>
          <addressOffset>0xB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PGAEN</name>
              <description>PGA Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPGASAMPDUR</name>
              <description>ADC PGA Sample Duration</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>6CLK</name>
                  <description>6 ADC cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15CLK</name>
                  <description>15 ADC cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20CLK</name>
                  <description>20 ADC cycles</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGABIASSEL</name>
              <description>PGA BIAS Select</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1X</name>
                  <description>1x BIAS current</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_4X</name>
                  <description>3/4x BIAS current</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_2X</name>
                  <description>1/2x BIAS current</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_4X</name>
                  <description>1/4x BIAS current</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GAIN</name>
              <description>Gain</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1X</name>
                  <description>1X Gain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2X</name>
                  <description>2X Gain</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4X</name>
                  <description>4X Gain</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8X</name>
                  <description>8X Gain</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16X</name>
                  <description>16X Gain</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>4294967295</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SAMPLE</name>
          <description>Sample</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status register</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADCBUSY</name>
              <description>ADC Busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP0</name>
          <description>Temporary Data 0</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEMP</name>
              <description>Temporary</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP1</name>
          <description>Temporary Data 1</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEMP</name>
              <description>Temporary</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMP2</name>
          <description>Temporary Data 2</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEMP</name>
              <description>Temporary</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WINHT</name>
          <description>Window High Threshold</description>
          <addressOffset>0x1E</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>WINLT</name>
          <description>Window Low Threshold</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
