garyPenhook/PyAvrOCD/svd/attiny827.svd
        <register>
          <name>CHANNEL4</name>
          <description>Multiplexer Channel 4</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL4</name>
              <description>Channel 4 generator select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI</name>
                  <description>Unified Program and Debug Interface</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV8192</name>
                  <description>Periodic Interrupt Timer output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV4096</name>
                  <description>Periodic Interrupt Timer output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV2048</name>
                  <description>Periodic Interrupt Timer output 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV1024</name>
                  <description>Periodic Interrupt Timer output 3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT2</name>
                  <description>Configurable Custom Logic LUT2</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT3</name>
                  <description>Configurable Custom Logic LUT3</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_RES</name>
                  <description>ADC 0 Result ready event</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_SAMP</name>
                  <description>ADC 0 Sample ready event</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_WCMP</name>
                  <description>ADC 0 Window compare match event</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN0</name>
                  <description>Port B Pin 0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN1</name>
                  <description>Port B Pin 1</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN2</name>
                  <description>Port B Pin 2</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN3</name>
                  <description>Port B Pin 3</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN4</name>
                  <description>Port B Pin 4</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN5</name>
                  <description>Port B Pin 5</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN6</name>
                  <description>Port B Pin 6</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN7</name>
                  <description>Port B Pin 7</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN0</name>
                  <description>Port C Pin 0</description>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN1</name>
                  <description>Port C Pin 1</description>
                  <value>73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN2</name>
                  <description>Port C Pin 2</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN3</name>
                  <description>Port C Pin 3</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN4</name>
                  <description>Port C Pin 4</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN5</name>
                  <description>Port C Pin 5</description>
                  <value>77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0_XCK</name>
                  <description>USART 0 XCK</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_XCK</name>
                  <description>USART 1 XCK</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>SPI 0 Sclock</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 overflow / low byte underflow</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 high byte underflow</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0_LCMP0</name>
                  <description>Timer/Counter A0 compare 0 / low byte timer compare 0</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1_LCMP1</name>
                  <description>Timer/Counter A0 compare 1 / low byte timer compare 1</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2_LCMP2</name>
                  <description>Timer/Counter A0 compare 2 / low byte timer compare 2</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_CAPT</name>
                  <description>Timer/Counter B0 capture</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_OVF</name>
                  <description>Timer/Counter B0 overflow</description>
                  <value>161</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_CAPT</name>
                  <description>Timer/Counter B1 capture</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_OVF</name>
                  <description>Timer/Counter B1 overflow</description>
                  <value>163</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL5</name>
          <description>Multiplexer Channel 5</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL5</name>
              <description>Channel 5 generator select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI</name>
                  <description>Unified Program and Debug Interface</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV512</name>
                  <description>Periodic Interrupt Timer output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV256</name>
                  <description>Periodic Interrupt Timer output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV128</name>
                  <description>Periodic Interrupt Timer output 2</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_PIT_DIV64</name>
                  <description>Periodic Interrupt Timer output 3</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT2</name>
                  <description>Configurable Custom Logic LUT2</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT3</name>
                  <description>Configurable Custom Logic LUT3</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_RES</name>
                  <description>ADC 0 Result ready event</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_SAMP</name>
                  <description>ADC 0 Sample ready event</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_WCMP</name>
                  <description>ADC 0 Window compare match event</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN0</name>
                  <description>Port B Pin 0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN1</name>
                  <description>Port B Pin 1</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN2</name>
                  <description>Port B Pin 2</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN3</name>
                  <description>Port B Pin 3</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN4</name>
                  <description>Port B Pin 4</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN5</name>
                  <description>Port B Pin 5</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN6</name>
                  <description>Port B Pin 6</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN7</name>
                  <description>Port B Pin 7</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN0</name>
                  <description>Port C Pin 0</description>
                  <value>72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN1</name>
                  <description>Port C Pin 1</description>
                  <value>73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN2</name>
                  <description>Port C Pin 2</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN3</name>
                  <description>Port C Pin 3</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN4</name>
                  <description>Port C Pin 4</description>
                  <value>76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN5</name>
                  <description>Port C Pin 5</description>
                  <value>77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0_XCK</name>
                  <description>USART 0 XCK</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_XCK</name>
                  <description>USART 1 XCK</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>SPI 0 Sclock</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 overflow / low byte underflow</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 high byte underflow</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0_LCMP0</name>
                  <description>Timer/Counter A0 compare 0 / low byte timer compare 0</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1_LCMP1</name>
                  <description>Timer/Counter A0 compare 1 / low byte timer compare 1</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2_LCMP2</name>
                  <description>Timer/Counter A0 compare 2 / low byte timer compare 2</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_CAPT</name>
                  <description>Timer/Counter B0 capture</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_OVF</name>
                  <description>Timer/Counter B0 overflow</description>
                  <value>161</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_CAPT</name>
                  <description>Timer/Counter B1 capture</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_OVF</name>
                  <description>Timer/Counter B1 overflow</description>
                  <value>163</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWEVENTA</name>
          <description>Software Event A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SWEVENTA</name>
              <description>Software event on channel</description>
              <bitRange>[7:0]</bitRange>
              <access>write-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CH0</name>
                  <description>Software event on channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH1</name>
                  <description>Software event on channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH2</name>
                  <description>Software event on channel 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH3</name>
                  <description>Software event on channel 3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH4</name>
                  <description>Software event on channel 4</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CH5</name>
                  <description>Software event on channel 5</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERADC0START</name>
          <description>User ADC0</description>
          <addressOffset>0x28</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>Channel selector</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
